ShahinFi/seba-robot/firmware/stm32/src/console/console.c
#include "console.h"

#include "control/actuator/actuator.h"
#include "control/motion_control/motion_control.h"
#include "control/state_estimation/state_estimation.h"
#include "serial/serial.h"
#include "tests/current_sensor_test.h"
#include "tests/encoder_test.h"
#include "tests/imu_test.h"
#include "tests/motor_test.h"

#include "stm32g4xx_hal.h"

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#define CONSOLE_LINE_LENGTH   160U
#define CONSOLE_MAX_ARGUMENTS   5
#define CONSOLE_RECENT_COMMAND_IDS  16U

static char input_line[CONSOLE_LINE_LENGTH];
static uint32_t input_length;

static void Console_ProcessByte(uint8_t byte);
static void Console_ExecuteLine(char *line);
static bool Console_TryExecuteFramedCommand(char *line);
static bool Console_CommandIdWasSeen(uint32_t command_id);
static void Console_RememberCommandId(uint32_t command_id);

static int Console_Tokenize(
    char *line,
    char *arguments[],
    int maximum_arguments
);

static void Console_HandleMotor(
    int argument_count,
    char *arguments[]
);

static void Console_HandleEncoder(
    int argument_count,
    char *arguments[]
);

static void Console_HandleCurrent(
    int argument_count,
    char *arguments[]
);

static void Console_HandleActuator(
    int argument_count,
    char *arguments[]
);

static void Console_HandleState(
    int argument_count,
    char *arguments[]
);

static void Console_HandleBalance(
    int argument_count,
    char *arguments[]
);

static void Console_HandleTelemetry(
    int argument_count,
    char *arguments[]
);

static void Console_HandleSystem(
    int argument_count,
    char *arguments[]
);

static void Console_HandleIMU(
    int argument_count,
    char *arguments[]
);

static bool Console_ParseSpeed(
    const char *text,
    int16_t *speed
);

static bool Console_ParseInt32(
    const char *text,
    int32_t minimum,
    int32_t maximum,
    int32_t *value
);

static bool Console_ParseFloat(
    const char *text,
    float minimum,
    float maximum,
    float *value
);

static void Console_PrintActuatorConfig(void);
static void Console_PrintActuatorStatus(void);
static void Console_PrintBalanceStatus(void);
static void Console_PrintState(void);
static void Console_PrintHelp(void);

static uint32_t recent_command_ids[CONSOLE_RECENT_COMMAND_IDS];
static uint32_t recent_command_id_index;

void Console_Init(void)
{
    input_length = 0U;
    input_line[0] = '\0';
    memset(
        recent_command_ids,
        0,
        sizeof(recent_command_ids)
    );
    recent_command_id_index = 0U;
}

void Console_Process(void)
{
    uint8_t byte;

    while (Serial_ReadByte(&byte))
    {
        Console_ProcessByte(byte);
    }
}

static void Console_ProcessByte(uint8_t byte)
{
    if (
        byte == '\r' ||
        byte == '\n'
    )
    {
        if (input_length == 0U)
        {
            return;
        }

        input_line[input_length] = '\0';

        Console_ExecuteLine(input_line);

        input_length = 0U;
        input_line[0] = '\0';

        return;
    }

    if (
        byte == '\b' ||
        byte == 127U
    )
    {
        if (input_length > 0U)
        {
            input_length--;

            input_line[input_length] = '\0';
        }

        return;
    }

    if (
        byte < 32U ||
        byte > 126U
    )
    {
        return;
    }

    if (
        input_length >=
        CONSOLE_LINE_LENGTH - 1U
    )
    {
        /*
         * Discard the partial command so the next line starts
         * from a known empty buffer.
         */
        input_length = 0U;
        input_line[0] = '\0';

        Serial_WriteLine(
            "ERROR: command is too long."
        );

        return;
    }

    input_line[input_length] =
        (char)byte;

    input_length++;

    input_line[input_length] = '\0';
}

static void Console_ExecuteLine(char *line)
{
    char *arguments[CONSOLE_MAX_ARGUMENTS];

    if (Console_TryExecuteFramedCommand(line))
    {
        return;
    }

    const int argument_count =
        Console_Tokenize(
            line,
            arguments,
            CONSOLE_MAX_ARGUMENTS
        );

    if (argument_count == 0)
    {
        return;
    }

    if (strcmp(arguments[0], "help") == 0)
    {
        if (argument_count != 1)
        {
            Serial_WriteLine(
                "ERROR: usage: help"
            );

            return;
        }

        Console_PrintHelp();

        return;
    }

    if (strcmp(arguments[0], "motor") == 0)
    {
        Console_HandleMotor(
            argument_count,
            arguments
        );

        return;
    }

    if (strcmp(arguments[0], "encoder") == 0)
    {
        Console_HandleEncoder(
            argument_count,
            arguments
        );

        return;
    }

    if (strcmp(arguments[0], "current") == 0)
    {
        Console_HandleCurrent(
            argument_count,
            arguments
        );

        return;
    }

    if (strcmp(arguments[0], "actuator") == 0)
    {
        Console_HandleActuator(
            argument_count,
            arguments
        );

        return;
    }

    if (strcmp(arguments[0], "state") == 0)
    {
        Console_HandleState(
            argument_count,
            arguments
        );

        return;
    }

    if (strcmp(arguments[0], "balance") == 0)
    {
        Console_HandleBalance(
            argument_count,
            arguments
        );

        return;
    }

    if (strcmp(arguments[0], "telemetry") == 0)
    {
        Console_HandleTelemetry(
            argument_count,
            arguments
        );

        return;
    }

    if (strcmp(arguments[0], "system") == 0)
    {
        Console_HandleSystem(
            argument_count,
            arguments
        );

        return;
    }

    if (strcmp(arguments[0], "imu") == 0)
    {
        Console_HandleIMU(
            argument_count,
            arguments
        );

        return;
    }

    Serial_WriteLine(
        "ERROR: unknown command."
    );

    Serial_WriteLine(
        "Type 'help' for available commands."
    );
}

static bool Console_TryExecuteFramedCommand(char *line)
{
    char *id_text;
    char *command;
    int32_t command_id;

    if (strncmp(line, "CMD ", 4U) != 0)
    {
        return false;
    }

