ShahinFi/seba-robot/firmware/stm32/src/console/console.c
    id_text =
        line + 4U;

    command =
        strchr(id_text, ' ');

    if (command == NULL)
    {
        Serial_WriteLine(
            "ACK 0 ERROR"
        );

        return true;
    }

    *command = '\0';
    command++;

    if (
        !Console_ParseInt32(
            id_text,
            1,
            2147483647L,
            &command_id
        ) ||
        command[0] == '\0'
    )
    {
        Serial_WriteLine(
            "ACK 0 ERROR"
        );

        return true;
    }

    Serial_Write("ACK ");
    Serial_WriteUInt32((uint32_t)command_id);
    Serial_WriteLine(" OK");

    if (
        Console_CommandIdWasSeen(
            (uint32_t)command_id
        )
    )
    {
        return true;
    }

    Console_RememberCommandId(
        (uint32_t)command_id
    );

    Console_ExecuteLine(command);

    return true;
}

static bool Console_CommandIdWasSeen(uint32_t command_id)
{
    for (
        uint32_t index = 0U;
        index < CONSOLE_RECENT_COMMAND_IDS;
        index++
    )
    {
        if (recent_command_ids[index] == command_id)
        {
            return true;
        }
    }

    return false;
}

static void Console_RememberCommandId(uint32_t command_id)
{
    recent_command_ids[recent_command_id_index] =
        command_id;

    recent_command_id_index++;

    if (recent_command_id_index >= CONSOLE_RECENT_COMMAND_IDS)
    {
        recent_command_id_index = 0U;
    }
}

static int Console_Tokenize(
    char *line,
    char *arguments[],
    int maximum_arguments
)
{
    int argument_count = 0;

    char *token =
        strtok(line, " \t");

    while (
        token != NULL &&
        argument_count < maximum_arguments
    )
    {
        arguments[argument_count] =
            token;

        argument_count++;

        token =
            strtok(NULL, " \t");
    }

    return argument_count;
}

static void Console_HandleMotor(
    int argument_count,
    char *arguments[]
)
{
    int16_t speed;

    if (
        argument_count == 2 &&
        strcmp(arguments[1], "stop") == 0
    )
    {
        MotionControl_Disable();
        MotorTest_Stop();

        Serial_WriteLine(
            "OK: all motors stopped and disabled."
        );

        return;
    }

    if (argument_count != 3)
    {
        Serial_WriteLine(
            "ERROR: usage: motor <left|right> <-100...100> OR motor stop"
        );

        return;
    }

    if (!Console_ParseSpeed(
            arguments[2],
            &speed
        ))
    {
        Serial_WriteLine(
            "ERROR: speed must be an integer from -100 to 100."
        );

        return;
    }

    if (strcmp(arguments[1], "left") == 0)
    {
        MotionControl_Disable();

        if (!MotorTest_SetLeft(speed))
        {
            Serial_WriteLine(
                "ERROR: invalid left motor command."
            );

            return;
        }

        Serial_Write(
            "OK: left motor = "
        );

        Serial_Write(arguments[2]);

        Serial_WriteLine("%");

        return;
    }

    if (strcmp(arguments[1], "right") == 0)
    {
        MotionControl_Disable();

        if (!MotorTest_SetRight(speed))
        {
            Serial_WriteLine(
                "ERROR: invalid right motor command."
            );

            return;
        }

        Serial_Write(
            "OK: right motor = "
        );

        Serial_Write(arguments[2]);

        Serial_WriteLine("%");

        return;
    }

    Serial_WriteLine(
        "ERROR: motor must be 'left', 'right', or 'stop'."
    );
}

static void Console_HandleEncoder(
    int argument_count,
    char *arguments[]
)
{
    if (argument_count != 2)
    {
        Serial_WriteLine(
            "ERROR: usage: encoder <read|reset>"
        );

        return;
    }

    if (strcmp(arguments[1], "read") == 0)
    {
        EncoderTest_PrintPositions();

        return;
    }

    if (strcmp(arguments[1], "reset") == 0)
    {
        EncoderTest_ResetPositions();
        StateEstimation_Reset();

        return;
    }

    Serial_WriteLine(
        "ERROR: usage: encoder <read|reset>"
    );
}

static void Console_HandleCurrent(
    int argument_count,
    char *arguments[]
)
{
    CurrentSensorChannel channel;
    int32_t sample_count;

    if (
        argument_count == 2 &&
        strcmp(arguments[1], "read") == 0
    )
    {
        if (Actuator_IsEnabled())
        {
            Serial_WriteLine(
                "ERROR: stop actuator control before using current read."
            );

            return;
        }

        if (!CurrentSensorTest_PrintReadings())
        {
            Serial_WriteLine(
                "ERROR: current sensor read failed."
            );

            return;
        }

        return;
    }

    if (
        argument_count == 4 &&
        strcmp(arguments[1], "scope") == 0
    )
    {
        if (strcmp(arguments[2], "left") == 0)
        {
            channel = CURRENT_SENSOR_LEFT;
        }
        else if (strcmp(arguments[2], "right") == 0)
        {
            channel = CURRENT_SENSOR_RIGHT;
        }
        else
        {
            Serial_WriteLine(
                "ERROR: current scope channel must be 'left' or 'right'."
            );

            return;
        }

        if (!Console_ParseInt32(
                arguments[3],
                1,
                10000,
                &sample_count
            ))
        {
            Serial_WriteLine(
                "ERROR: sample count must be 1 to 10000."
            );

            return;
        }

        if (Actuator_IsEnabled())
        {
            Serial_WriteLine(
                "ERROR: stop actuator control before using current scope."
            );

            return;
        }

        if (!CurrentSensorTest_PrintCapture(
                channel,
                (uint32_t)sample_count
            ))
        {
            Serial_WriteLine(
                "ERROR: current sensor capture failed."
            );

            return;
        }

        return;
    }

    Serial_WriteLine(
        "ERROR: usage: current read OR current scope <left|right> <samples>"
    );
}

