ShahinFi/seba-robot/firmware/stm32/src/console/console.c
static void Console_HandleActuator(
    int argument_count,
    char *arguments[]
)
{
    int32_t value;
    int32_t second_value;
    ActuatorStatus status;

    if (argument_count == 2)
    {
        if (strcmp(arguments[1], "stop") == 0)
        {
            MotionControl_Disable();

            Serial_WriteLine(
                "OK: actuator current control stopped."
            );

            return;
        }

        if (strcmp(arguments[1], "status") == 0)
        {
            Console_PrintActuatorStatus();
            return;
        }

        if (strcmp(arguments[1], "config") == 0)
        {
            Console_PrintActuatorConfig();
            return;
        }
    }

    if (argument_count == 3)
    {
        if (!Console_ParseInt32(
                arguments[2],
                -100000L,
                100000L,
                &value
            ))
        {
            Serial_WriteLine(
                "ERROR: actuator value must be an integer."
            );

            return;
        }

        Actuator_GetStatus(
            &status
        );

        if (strcmp(arguments[1], "left") == 0)
        {
            if (!Actuator_SetCurrentReferences(
                    value,
                    status.right_current_reference_ma
                ))
            {
                Serial_WriteLine(
                    "ERROR: current reference exceeds configured limit."
                );

                return;
            }

            MotorTest_Stop();
            MotionControl_Disable();
            Actuator_Enable();

            Serial_WriteLine(
                "OK: left current reference updated."
            );

            return;
        }

        if (strcmp(arguments[1], "right") == 0)
        {
            if (!Actuator_SetCurrentReferences(
                    status.left_current_reference_ma,
                    value
                ))
            {
                Serial_WriteLine(
                    "ERROR: current reference exceeds configured limit."
                );

                return;
            }

            MotorTest_Stop();
            MotionControl_Disable();
            Actuator_Enable();

            Serial_WriteLine(
                "OK: right current reference updated."
            );

            return;
        }

        if (strcmp(arguments[1], "kp") == 0)
        {
            if (!Actuator_SetProportionalGain(value))
            {
                Serial_WriteLine(
                    "ERROR: kp must be nonnegative."
                );

                return;
            }

            Serial_WriteLine("OK: actuator kp updated.");
            return;
        }

        if (strcmp(arguments[1], "ki") == 0)
        {
            if (!Actuator_SetIntegralGain(value))
            {
                Serial_WriteLine(
                    "ERROR: ki must be nonnegative."
                );

                return;
            }

            Serial_WriteLine("OK: actuator ki updated.");
            return;
        }

        if (strcmp(arguments[1], "battery") == 0)
        {
            if (!Actuator_SetBatteryVoltage(value))
            {
                Serial_WriteLine(
                    "ERROR: battery voltage must be positive."
                );

                return;
            }

            Serial_WriteLine(
                "OK: actuator battery voltage updated."
            );

            return;
        }

        if (strcmp(arguments[1], "max-current") == 0)
        {
            if (!Actuator_SetMaxCurrentReference(value))
            {
                Serial_WriteLine(
                    "ERROR: max current must be nonnegative."
                );

                return;
            }

            Serial_WriteLine(
                "OK: actuator current limit updated."
            );

            return;
        }

        if (strcmp(arguments[1], "max-pwm") == 0)
        {
            if (
                value < 0 ||
                value > 100 ||
                !Actuator_SetMaxCommandPercent(
                    (int16_t)value
                )
            )
            {
                Serial_WriteLine(
                    "ERROR: max PWM must be 0 to 100 percent."
                );

                return;
            }

            Serial_WriteLine(
                "OK: actuator PWM limit updated."
            );

            return;
        }

        if (strcmp(arguments[1], "integral-limit") == 0)
        {
            if (!Actuator_SetIntegralLimit(value))
            {
                Serial_WriteLine(
                    "ERROR: integral limit must be nonnegative."
                );

                return;
            }

            Serial_WriteLine(
                "OK: actuator integral limit updated."
            );

            return;
        }

        if (strcmp(arguments[1], "period") == 0)
        {
            if (
                value <= 0 ||
                value > 1000 ||
                !Actuator_SetControlPeriod(
                    (uint32_t)value
                )
            )
            {
                Serial_WriteLine(
                    "ERROR: period must be 1 to 1000 ms."
                );

                return;
            }

            Serial_WriteLine(
                "OK: actuator control period updated."
            );

            return;
        }

        if (strcmp(arguments[1], "torque-constant") == 0)
        {
            if (!Actuator_SetWheelTorqueConstant(value))
            {
                Serial_WriteLine(
                    "ERROR: torque constant must be positive."
                );

                return;
            }

            Serial_WriteLine(
                "OK: actuator torque constant updated."
            );

            return;
        }
    }

    if (
        argument_count == 4 &&
        (
            strcmp(arguments[1], "both") == 0 ||
            strcmp(arguments[1], "torque") == 0
        )
    )
    {
        if (
            !Console_ParseInt32(
                arguments[2],
                -100000L,
                100000L,
                &value
            ) ||
            !Console_ParseInt32(
                arguments[3],
                -100000L,
                100000L,
                &second_value
            )
        )
        {
            Serial_WriteLine(
                "ERROR: current references must be integers."
            );

            return;
        }

        if (strcmp(arguments[1], "both") == 0)
        {
            if (!Actuator_SetCurrentReferences(
                    value,
                    second_value
                ))
            {
                Serial_WriteLine(
                    "ERROR: current reference exceeds configured limit."
                );

                return;
            }
        }
        else
        {
            if (!Actuator_SetWheelTorqueReferences(
                    value,
                    second_value
                ))
            {
                Serial_WriteLine(
                    "ERROR: torque reference exceeds configured current limit."
                );

                return;
            }
        }

        MotorTest_Stop();
        MotionControl_Disable();
        Actuator_Enable();

        if (strcmp(arguments[1], "both") == 0)
        {
            Serial_WriteLine(
                "OK: actuator current references updated."
            );
        }
        else
        {
            Serial_WriteLine(
                "OK: actuator torque references updated."
            );
        }

        return;
    }

    Serial_WriteLine(
        "ERROR: usage: actuator <left|right> <mA>, actuator both <left_mA> <right_mA>, actuator torque <left_mNm> <right_mNm>, actuator stop, actuator status, actuator config"
    );
}

static void Console_HandleIMU(
    int argument_count,
    char *arguments[]
)
{
    if (
        argument_count != 2 ||
        strcmp(arguments[1], "read") != 0
    )
    {
        Serial_WriteLine(
            "ERROR: usage: imu read"
        );

        return;
    }

    if (!IMUTest_PrintLatest())
    {
        Serial_WriteLine(
            "ERROR: IMU is not initialized."
        );

        return;
    }
}

static void Console_HandleState(
    int argument_count,
    char *arguments[]
)
{
    if (
        argument_count != 2 ||
        strcmp(arguments[1], "read") != 0
    )
    {
        Serial_WriteLine(
            "ERROR: usage: state read"
        );

        return;
    }

