ShahinFi/seba-robot/firmware/stm32/src/console/console.c
    Console_PrintState();
}

static void Console_HandleBalance(
    int argument_count,
    char *arguments[]
)
{
    int32_t value;
    int32_t column;
    uint32_t row;
    float float_value;
    float second_float_value;

    if (
        argument_count == 3 &&
        (
            strcmp(arguments[1], "max-torque") == 0 ||
            strcmp(arguments[1], "gain-scale") == 0
        )
    )
    {
        if (!Console_ParseInt32(
                arguments[2],
                0,
                10000,
                &value
            ))
        {
            Serial_WriteLine(
                "ERROR: balance value must be 0 to 10000."
            );

            return;
        }

        if (strcmp(arguments[1], "max-torque") == 0)
        {
            if (!MotionControl_SetMaxWheelTorque(
                    (float)value
                ))
            {
                Serial_WriteLine(
                    "ERROR: balance max torque update failed."
                );

                return;
            }

            Serial_WriteLine(
                "OK: balance torque limit updated."
            );

            return;
        }

        if (!MotionControl_SetGainScale(
                (float)value /
                100.0F
            ))
        {
            Serial_WriteLine(
                "ERROR: balance gain scale update failed."
            );

            return;
        }

        Serial_WriteLine(
            "OK: balance gain scale updated."
        );

        return;
    }

    if (
        argument_count == 4 &&
        strcmp(arguments[1], "command") == 0
    )
    {
        if (
            !Console_ParseFloat(
                arguments[2],
                -10.0F,
                10.0F,
                &float_value
            ) ||
            !Console_ParseFloat(
                arguments[3],
                -20.0F,
                20.0F,
                &second_float_value
            )
        )
        {
            Serial_WriteLine(
                "ERROR: balance command values are out of range."
            );

            return;
        }

        (void)MotionControl_SetCommand(
            float_value,
            second_float_value
        );

        Serial_WriteLine(
            "OK: balance command updated."
        );

        return;
    }

    if (
        argument_count == 5 &&
        strcmp(arguments[1], "gain") == 0
    )
    {
        if (strcmp(arguments[2], "left") == 0)
        {
            row = 0U;
        }
        else if (strcmp(arguments[2], "right") == 0)
        {
            row = 1U;
        }
        else
        {
            Serial_WriteLine(
                "ERROR: balance gain side must be 'left' or 'right'."
            );

            return;
        }

        if (
            !Console_ParseInt32(
                arguments[3],
                0,
                5,
                &column
            ) ||
            !Console_ParseFloat(
                arguments[4],
                -100000.0F,
                100000.0F,
                &float_value
            )
        )
        {
            Serial_WriteLine(
                "ERROR: balance gain requires column 0 to 5 and numeric gain."
            );

            return;
        }

        if (!MotionControl_SetGain(
                row,
                (uint32_t)column,
                float_value
            ))
        {
            Serial_WriteLine(
                "ERROR: balance gain update failed."
            );

            return;
        }

        Serial_WriteLine(
            "OK: balance gain updated."
        );

        return;
    }

    if (argument_count != 2)
    {
        Serial_WriteLine(
            "ERROR: usage: balance <start|stop|status> OR balance max-torque <mNm> OR balance gain-scale <percent> OR balance command <v> <yaw> OR balance gain <left|right> <0...5> <value>"
        );

        return;
    }

    if (strcmp(arguments[1], "start") == 0)
    {
        MotorTest_Stop();
        MotionControl_Enable();

        Serial_WriteLine(
            "OK: balance control started."
        );

        return;
    }

    if (strcmp(arguments[1], "stop") == 0)
    {
        MotionControl_Disable();

        Serial_WriteLine(
            "OK: balance control stopped."
        );

        return;
    }

    if (strcmp(arguments[1], "status") == 0)
    {
        Console_PrintBalanceStatus();
        return;
    }

    Serial_WriteLine(
        "ERROR: usage: balance <start|stop|status> OR balance max-torque <mNm> OR balance gain-scale <percent> OR balance command <v> <yaw> OR balance gain <left|right> <0...5> <value>"
    );
}

static void Console_HandleTelemetry(
    int argument_count,
    char *arguments[]
)
{
    if (
        argument_count != 2 ||
        strcmp(arguments[1], "read") != 0
    )
    {
        Serial_WriteLine(
            "ERROR: usage: telemetry read"
        );

        return;
    }

    Console_PrintTelemetry();
}

static void Console_HandleSystem(
    int argument_count,
    char *arguments[]
)
{
    if (
        argument_count != 2 ||
        strcmp(arguments[1], "reset") != 0
    )
    {
        Serial_WriteLine(
            "ERROR: usage: system reset"
        );

        return;
    }

    Serial_WriteLine(
        "OK: resetting STM32."
    );

    HAL_Delay(20U);
    NVIC_SystemReset();
}

static bool Console_ParseSpeed(
    const char *text,
    int16_t *speed
)
{
    char *end;
    long value;

    if (
        text == NULL ||
        speed == NULL ||
        text[0] == '\0'
    )
    {
        return false;
    }

    errno = 0;

    value =
        strtol(
            text,
            &end,
            10
        );

    if (
        end == text ||
        *end != '\0' ||
        errno == ERANGE ||
        value < -100L ||
        value > 100L
    )
    {
        return false;
    }

    *speed =
        (int16_t)value;

    return true;
}

static bool Console_ParseInt32(
    const char *text,
    int32_t minimum,
    int32_t maximum,
    int32_t *value
)
{
    char *end;
    long parsed;

    if (
        text == NULL ||
        value == NULL ||
        text[0] == '\0'
    )
    {
        return false;
    }

