ShahinFi/seba-robot/firmware/stm32/src/console/console.c
    errno = 0;

    parsed =
        strtol(
            text,
            &end,
            10
        );

    if (
        end == text ||
        *end != '\0' ||
        errno == ERANGE ||
        parsed < minimum ||
        parsed > maximum
    )
    {
        return false;
    }

    *value =
        (int32_t)parsed;

    return true;
}

static bool Console_ParseFloat(
    const char *text,
    float minimum,
    float maximum,
    float *value
)
{
    char *end;
    float parsed;

    if (
        text == NULL ||
        value == NULL ||
        text[0] == '\0'
    )
    {
        return false;
    }

    errno = 0;

    parsed =
        strtof(
            text,
            &end
        );

    if (
        end == text ||
        *end != '\0' ||
        errno == ERANGE ||
        parsed < minimum ||
        parsed > maximum
    )
    {
        return false;
    }

    *value =
        parsed;

    return true;
}

static void Console_PrintActuatorConfig(void)
{
    ActuatorConfig config;

    Actuator_GetConfig(
        &config
    );

    Serial_WriteLine("Actuator config:");

    Serial_Write("  Period [ms]: ");
    Serial_WriteUInt32(config.control_period_ms);
    Serial_WriteLine("");

    Serial_Write("  Battery [mV]: ");
    Serial_WriteInt32(config.battery_voltage_mv);
    Serial_WriteLine("");

    Serial_Write("  Kp [mV/A]: ");
    Serial_WriteInt32(config.proportional_gain_mv_per_a);
    Serial_WriteLine("");

    Serial_Write("  Ki [mV/(A*s)]: ");
    Serial_WriteInt32(config.integral_gain_mv_per_a_s);
    Serial_WriteLine("");

    Serial_Write("  Integral limit [mV]: ");
    Serial_WriteInt32(config.integral_limit_mv);
    Serial_WriteLine("");

    Serial_Write("  Current limit [mA]: ");
    Serial_WriteInt32(config.max_current_reference_ma);
    Serial_WriteLine("");

    Serial_Write("  PWM limit [%]: ");
    Serial_WriteInt32(config.max_command_percent);
    Serial_WriteLine("");

    Serial_Write("  Torque constant [mN*m/A]: ");
    Serial_WriteInt32(config.wheel_torque_constant_mnm_per_a);
    Serial_WriteLine("");
}

static void Console_PrintActuatorStatus(void)
{
    ActuatorStatus status;

    Actuator_GetStatus(
        &status
    );

    Serial_Write("Actuator: enabled=");
    Serial_Write(status.enabled ? "yes" : "no");

    Serial_Write(" fault=");
    Serial_Write(status.fault_active ? "ACTIVE" : "normal");

    Serial_Write(" read_failed=");
    Serial_Write(status.read_failed ? "yes" : "no");

    Serial_Write(" left_ref=");
    Serial_WriteInt32(status.left_current_reference_ma);

    Serial_Write(" left_meas=");
    Serial_WriteInt32(status.left_current_measured_ma);

    Serial_Write(" left_err=");
    Serial_WriteInt32(status.left_error_ma);

    Serial_Write(" left_pwm=");
    Serial_WriteInt32(status.left_command_permille);

    Serial_Write(" right_ref=");
    Serial_WriteInt32(status.right_current_reference_ma);

    Serial_Write(" right_meas=");
    Serial_WriteInt32(status.right_current_measured_ma);

    Serial_Write(" right_err=");
    Serial_WriteInt32(status.right_error_ma);

    Serial_Write(" right_pwm=");
    Serial_WriteInt32(status.right_command_permille);
    Serial_WriteLine("");
}

static void Console_PrintBalanceStatus(void)
{
    MotionControlStatus status;

    MotionControl_GetStatus(
        &status
    );

    Serial_Write("Balance: enabled=");
    Serial_Write(status.enabled ? "yes" : "no");

    Serial_Write(" fault=");
    Serial_Write(status.fault_active ? "ACTIVE" : "normal");

    Serial_Write(" state_invalid=");
    Serial_Write(status.state_invalid ? "yes" : "no");

    Serial_Write(" fall=");
    Serial_Write(status.fall_detected ? "yes" : "no");

    Serial_Write(" v_cmd=");
    Serial_WriteFloat3(status.forward_velocity_command_mps);

    Serial_Write(" yaw_cmd=");
    Serial_WriteFloat3(status.yaw_rate_command_rads);

    Serial_Write(" left_T=");
    Serial_WriteFloat3(status.left_torque_command_mnm);

    Serial_Write(" right_T=");
    Serial_WriteFloat3(status.right_torque_command_mnm);

    Serial_Write(" left_dT=");
    Serial_WriteFloat3(status.left_torque_rate_mnm_s);

    Serial_Write(" right_dT=");
    Serial_WriteFloat3(status.right_torque_rate_mnm_s);

    Serial_Write(" max_T=");
    Serial_WriteFloat3(status.max_wheel_torque_mnm);

    Serial_Write(" gain=");
    Serial_WriteFloat3(status.motion_gain_scale);

    Serial_WriteLine("");
}

static void Console_PrintState(void)
{
    RobotState state;

    StateEstimation_GetState(
        &state
    );

    Serial_Write("State: valid=");
    Serial_Write(state.valid ? "yes" : "no");

    Serial_Write(" imu=");
    Serial_Write(state.imu_valid ? "yes" : "no");

    Serial_Write(" encoder=");
    Serial_Write(state.encoder_valid ? "yes" : "no");

    Serial_Write(" updates=");
    Serial_WriteUInt32(state.update_count);
    Serial_WriteLine("");

    Serial_Write("  v [m/s]: ");
    Serial_WriteFloat3(state.forward_velocity_mps);
    Serial_WriteLine("");

    Serial_Write("  theta [rad]: ");
    Serial_WriteFloat3(state.pitch_rad);
    Serial_WriteLine("");

    Serial_Write("  theta_dot [rad/s]: ");
    Serial_WriteFloat3(state.pitch_rate_rads);
    Serial_WriteLine("");

    Serial_Write("  psi_dot [rad/s]: ");
    Serial_WriteFloat3(state.yaw_rate_rads);
    Serial_WriteLine("");

    Serial_Write("  v_dot [m/s^2]: ");
    Serial_WriteFloat3(state.forward_acceleration_mps2);
    Serial_WriteLine("");

    Serial_Write("  theta_ddot [rad/s^2]: ");
    Serial_WriteFloat3(state.pitch_acceleration_rads2);
    Serial_WriteLine("");

    Serial_Write("  psi_ddot [rad/s^2]: ");
    Serial_WriteFloat3(state.yaw_acceleration_rads2);
    Serial_WriteLine("");
}

void Console_PrintTelemetry(void)
{
    RobotState state;
    MotionControlStatus balance;
    ActuatorStatus actuator;

    StateEstimation_GetState(
        &state
    );

    MotionControl_GetStatus(
        &balance
    );

    Actuator_GetStatus(
        &actuator
    );

    Serial_Write("TEL valid=");
    Serial_Write(state.valid ? "1" : "0");

    Serial_Write(" imu=");
    Serial_Write(state.imu_valid ? "1" : "0");

    Serial_Write(" enc=");
    Serial_Write(state.encoder_valid ? "1" : "0");

