ShahinFi/seba-robot/firmware/stm32/src/console/console.c
    Serial_Write(" updates=");
    Serial_WriteUInt32(state.update_count);

    Serial_Write(" v=");
    Serial_WriteFloat3(state.forward_velocity_mps);

    Serial_Write(" theta=");
    Serial_WriteFloat3(state.pitch_rad);

    Serial_Write(" theta_dot=");
    Serial_WriteFloat3(state.pitch_rate_rads);

    Serial_Write(" psi_dot=");
    Serial_WriteFloat3(state.yaw_rate_rads);

    Serial_Write(" v_dot=");
    Serial_WriteFloat3(state.forward_acceleration_mps2);

    Serial_Write(" theta_ddot=");
    Serial_WriteFloat3(state.pitch_acceleration_rads2);

    Serial_Write(" psi_ddot=");
    Serial_WriteFloat3(state.yaw_acceleration_rads2);

    Serial_Write(" balance=");
    Serial_Write(balance.enabled ? "1" : "0");

    Serial_Write(" fault=");
    Serial_Write(balance.fault_active ? "1" : "0");

    Serial_Write(" fall=");
    Serial_Write(balance.fall_detected ? "1" : "0");

    Serial_Write(" v_cmd=");
    Serial_WriteFloat3(balance.forward_velocity_command_mps);

    Serial_Write(" yaw_cmd=");
    Serial_WriteFloat3(balance.yaw_rate_command_rads);

    Serial_Write(" left_T=");
    Serial_WriteFloat3(balance.left_torque_command_mnm);

    Serial_Write(" right_T=");
    Serial_WriteFloat3(balance.right_torque_command_mnm);

    Serial_Write(" left_dT=");
    Serial_WriteFloat3(balance.left_torque_rate_mnm_s);

    Serial_Write(" right_dT=");
    Serial_WriteFloat3(balance.right_torque_rate_mnm_s);

    Serial_Write(" max_T=");
    Serial_WriteFloat3(balance.max_wheel_torque_mnm);

    Serial_Write(" gain=");
    Serial_WriteFloat3(balance.motion_gain_scale);

    Serial_Write(" act=");
    Serial_Write(actuator.enabled ? "1" : "0");

    Serial_Write(" left_ref=");
    Serial_WriteInt32(actuator.left_current_reference_ma);

    Serial_Write(" right_ref=");
    Serial_WriteInt32(actuator.right_current_reference_ma);

    Serial_Write(" left_meas=");
    Serial_WriteInt32(actuator.left_current_measured_ma);

    Serial_Write(" right_meas=");
    Serial_WriteInt32(actuator.right_current_measured_ma);

    Serial_Write(" left_pwm=");
    Serial_WriteInt32(actuator.left_command_permille);

    Serial_Write(" right_pwm=");
    Serial_WriteInt32(actuator.right_command_permille);

    Serial_WriteLine("");
}

static void Console_PrintHelp(void)
{
    Serial_WriteLine("Commands:");

    Serial_WriteLine(
        "  motor left <-100...100>"
    );

    Serial_WriteLine(
        "  motor right <-100...100>"
    );

    Serial_WriteLine(
        "  motor stop"
    );

    Serial_WriteLine(
        "  encoder read"
    );

    Serial_WriteLine(
        "  encoder reset"
    );

    Serial_WriteLine(
        "  current read"
    );

    Serial_WriteLine(
        "  current scope <left|right> <samples>"
    );

    Serial_WriteLine(
        "  actuator left <mA>"
    );

    Serial_WriteLine(
        "  actuator right <mA>"
    );

    Serial_WriteLine(
        "  actuator both <left_mA> <right_mA>"
    );

    Serial_WriteLine(
        "  actuator torque <left_mNm> <right_mNm>"
    );

    Serial_WriteLine(
        "  actuator stop"
    );

    Serial_WriteLine(
        "  actuator status"
    );

    Serial_WriteLine(
        "  actuator config"
    );

    Serial_WriteLine(
        "  actuator kp <mV_per_A>"
    );

    Serial_WriteLine(
        "  actuator ki <mV_per_A_s>"
    );

    Serial_WriteLine(
        "  actuator battery <mV>"
    );

    Serial_WriteLine(
        "  actuator max-current <mA>"
    );

    Serial_WriteLine(
        "  actuator max-pwm <percent>"
    );

    Serial_WriteLine(
        "  actuator integral-limit <mV>"
    );

    Serial_WriteLine(
        "  actuator period <ms>"
    );

    Serial_WriteLine(
        "  actuator torque-constant <mNm_per_A>"
    );

    Serial_WriteLine(
        "  state read"
    );

    Serial_WriteLine(
        "  balance start"
    );

    Serial_WriteLine(
        "  balance stop"
    );

    Serial_WriteLine(
        "  balance status"
    );

    Serial_WriteLine(
        "  balance max-torque <mNm>"
    );

    Serial_WriteLine(
        "  balance gain-scale <percent>"
    );

    Serial_WriteLine(
        "  balance command <v_mps> <yaw_rate_rads>"
    );

    Serial_WriteLine(
        "  balance gain <left|right> <0...5> <value>"
    );

    Serial_WriteLine(
        "  telemetry read"
    );

    Serial_WriteLine(
        "  system reset"
    );

    Serial_WriteLine(
        "  imu read"
    );

    Serial_WriteLine(
        "  help"
    );

    Serial_WriteLine("");

    Serial_WriteLine(
        "Positive motor command = forward"
    );

    Serial_WriteLine(
        "Negative motor command = reverse"
    );

    Serial_WriteLine(
        "Zero = stop that motor"
    );
}
